# RevitLinkOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitLinkOptions Methods
RevitLinkOptions Class See Also
---
The RevitLinkOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetWorksetConfiguration | Gets the set of worksets to open when creating the link. |
| SetWorksetConfiguration | Sets the set of worksets to open when creating the link. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
RevitLinkOptions Class
Autodesk.Revit.DB Namespace